There are several methods to install Arch Linux. This document describes a method a minimum version of Arch Linux. I try to refrain from installing large bundles and restrict to installing software that I need. The main driver is to learn more about Linux in the first place, and second to install less software yet do more.

This file can be used to install my version of Arch linux by tangling this file (org-bable-tanlge) and then run the output as sudo. Anarchy must be installed and the network must be up.
*** Video
First figure out what hardware you have onboard:
#+BEGIN_SRC bash
lspci | grep -e VGA -e 3D
#+END_SRC
#+RESULTS:
: 00:02.0 VGA compatible controller: Intel Corporation HD Graphics 620 (rev 02)

Now search for the correct driver in the package manager:
#+BEGIN_SRC bash
pacman -Ss xf86-video
#+END_SRC

#+RESULTS:
| extra/xf86-video-amdgpu     | 19.1.0-2                   | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | amdgpu                     | video                     | driver       |             |        |        |       |
| extra/xf86-video-ati        | 1:19.1.0-2                 | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | ati                        | video                     | driver       |             |        |        |       |
| extra/xf86-video-dummy      | 0.3.8-4                    | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | dummy                      | video                     | driver       |             |        |        |       |
| extra/xf86-video-fbdev      | 0.5.0-2                    | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | framebuffer                | video                     | driver       |             |        |        |       |
| extra/xf86-video-intel      | 1:2.99.917+908+g7181c5a4-1 | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | Intel                      | i810/i830/i915/945G/G965+ | video        | drivers     |        |        |       |
| extra/xf86-video-nouveau    | 1.0.16-2                   | (xorg-drivers)            |              |             |        |        |       |
| Open                        | Source                     | 3D                        | acceleration | driver      | for    | nVidia | cards |
| extra/xf86-video-openchrome | 0.6.0-4                    | (xorg-drivers)            |              |             |        |        |       |
| X.Org                       | Openchrome                 | drivers                   |              |             |        |        |       |
| extra/xf86-video-sisusb     | 0.9.7-3                    |                           |              |             |        |        |       |
| X.org                       | SiS                        | USB                       | video        | driver      |        |        |       |
| extra/xf86-video-vesa       | 2.4.0-3                    | (xorg-drivers             | xorg)        | [installed] |        |        |       |
| X.org                       | vesa                       | video                     | driver       |             |        |        |       |
| extra/xf86-video-vmware     | 13.3.0-2                   | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | vmware                     | video                     | driver       |             |        |        |       |
| extra/xf86-video-voodoo     | 1.2.5-11                   | (xorg-drivers)            |              |             |        |        |       |
| X.org                       | 3dfx                       | Voodoo1/Voodoo2           | 2D           | video       | driver |        |       |
| community/xf86-video-qxl    | 0.1.5-7                    | (xorg-drivers)            |              |             |        |        |       |
| Xorg                        | X11                        | qxl                       | video        | driver      |        |        |       |

Now install the correct driver with
#+BEGIN_SRC bash
sudo pacman -S xf86-video-intel
#+END_SRC
